<a href="https://colab.research.google.com/github/AlanDiego-py/AlanDiego/blob/main/input_output_com_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Importando Bibliotecas

In [2]:
import pandas as pd

In [16]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [ ]:
nomes_m

In [ ]:
nomes_m.shape

In [17]:
print("Nomes: " + str(len(nomes_m)+len(nomes_f)))

Nomes: 400

#Dois conjuntos em um único dataframe contendo os nomes de todos os alunos e alunas da escola. Para isso, criaremos uma variável frames que receberá uma lista contendo nossas informações.

In [18]:

frames = [nomes_f, nomes_m]

In [19]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

Na função pd.concat(), é possível especificar quais colunas queremos concatenar, nesse caso apenas a nome. Ao final, usaremos a função to_frame() para transformarmos o conjunto resultante em um dataframe.

In [23]:
nomes = pd.concat(frames)['nome'].to_frame()

In [21]:
import numpy as np
np.random.seed(456)

In [24]:
total_alunos = len(nomes)
total_alunos

400

Isso nos trará a nova coluna, id_aluno, que compreende números de 1 a 400 distribuídos aleatoriamente

In [29]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1
nomes.sample(5)

          nome  id_aluno
18    RAIMUNDO       209
12      AMANDA       229
172  WANDERSON       248
49        ALEX       159
96       TANIA       214

###A coluna nomes['dominio'] irá receber, randomicamente, algum dos domínios da nossa lista, algo que faremos com a função np.random.choice() para qual passaremos, como parâmetros, os dominios e o total_alunos.

In [31]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [32]:
nomes.sample(5)

          nome  id_aluno                 dominio
47       LUCIA       211  @dominiodoemail.com.br
186       INES        75     @servicodoemail.com
133     BRENDA       274     @servicodoemail.com
157  CONCEICAO       378     @servicodoemail.com
131   ANGELICA       133     @servicodoemail.com

In [33]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [34]:
nomes.sample(5)

        nome  id_aluno                 dominio                          email
193    KAUAN        10  @dominiodoemail.com.br    kauan@dominiodoemail.com.br
5      PAULO       191     @servicodoemail.com       paulo@servicodoemail.com
1        ANA       187     @servicodoemail.com         ana@servicodoemail.com
54    REGINA       114     @servicodoemail.com      regina@servicodoemail.com
196  ARLINDO       398  @dominiodoemail.com.br  arlindo@dominiodoemail.com.br